cask_args appdir: '/Applications'

tap 'azure/functions'
tap 'chrokh/tap'
tap 'federico-terzi/espanso'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'jmespath/jmespath'
tap 'varenc/ffmpeg'
tap 'azure/bicep'

brew 'azure-cli'
brew 'azure-functions-core-tools'
brew 'base16-manager'
brew 'bat'
brew 'bicep'
brew 'cmake'
brew 'dos2unix'
brew 'espanso'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'git-extras'
brew 'httpie'
brew 'jmespath/jmespath/jp'
brew 'jq'
brew 'keychain'
brew 'node@12'
brew 'python'
brew 'ripgrep'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'todo-txt'
brew 'varenc/ffmpeg/ffmpeg'
brew 'vim'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'alfred'
cask 'anki'
cask 'authy'
cask 'azure-data-studio'
cask 'bitwarden'
cask 'docker'
cask 'dotnet-sdk'
cask 'dropbox'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'keybase'
cask 'kindle'
cask 'microsoft-remote-desktop-beta'
cask 'octomouse'
cask 'postman'
cask 'powershell'
cask 'scroll-reverser'
cask 'signal'
cask 'steam'
cask 'visual-studio-code'
cask 'vlc'
cask 'qmk-toolbox'
